tutorials/incompressible/pimpleHFDIBFoam/AdapativeMeshRefinement/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  1;

        fields
        (
            p U
        );

        probeLocations
        (

  	  (0.05 0.082 0)
	);

// ************************************************************************* //
